# Pyspark BÃ¡sico
## Instalamos Pyspark

In [1]:
!pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.1.tar.gz (317.0 MB)
     ---------------------------------------- 0.0/317.0 MB ? eta -:--:--
     --------------------------------------- 0.8/317.0 MB 17.1 MB/s eta 0:00:19
     --------------------------------------- 1.8/317.0 MB 23.2 MB/s eta 0:00:14
     --------------------------------------- 2.6/317.0 MB 18.7 MB/s eta 0:00:17
     --------------------------------------- 3.4/317.0 MB 19.9 MB/s eta 0:00:16
     --------------------------------------- 3.8/317.0 MB 17.5 MB/s eta 0:00:18
      -------------------------------------- 5.0/317.0 MB 17.6 MB/s eta 0:00:18
      -------------------------------------- 6.0/317.0 MB 18.2 MB/s eta 0:00:18
      -------------------------------------- 6.8/317.0 MB 19.0 MB/s eta 0:00:17
      -------------------------------------- 7.4/317.0 MB 18.3 MB/s eta 0:00:17
     - ------------------------------------- 8.3/317.0 MB 18.2 MB/s eta 0:00:17
     - ------------------------------------- 9.2/317.0 MB 17.9 MB/s eta 0:00:18
     - ------------------------------------ 10.1/317.0 MB 18.0 MB/s eta 0:00:18
     - ------------------------------------ 11.1/317.0 MB 18.2 MB/s eta 0:00:17
     - ------------------------------------ 11.6/317.0 MB 17.7 MB/s eta 0:00:18
     - ------------------------------------ 12.2/317.0 MB 17.2 MB/s eta 0:00:18
     - ------------------------------------ 13.2/317.0 MB 17.2 MB/s eta 0:00:18
     - ------------------------------------ 14.1/317.0 MB 18.2 MB/s eta 0:00:17
     - ------------------------------------ 15.2/317.0 MB 18.2 MB/s eta 0:00:17
     - ------------------------------------ 15.7/317.0 MB 17.7 MB/s eta 0:00:18
     - ------------------------------------ 16.3/317.0 MB 16.8 MB/s eta 0:00:18
     -- ----------------------------------- 17.4/317.0 MB 16.8 MB/s eta 0:00:18
     -- ----------------------------------- 18.1/317.0 MB 17.7 MB/s eta 0:00:17
     -- ----------------------------------- 19.2/317.0 MB 18.2 MB/s eta 0:00:17
     -- ----------------------------------- 20.0/317.0 MB 17.7 MB/s eta 0:00:17
     -- ----------------------------------- 20.6/317.0 MB 17.2 MB/s eta 0:00:18
     -- ----------------------------------- 21.4/317.0 MB 16.8 MB/s eta 0:00:18
     -- ----------------------------------- 22.4/317.0 MB 18.2 MB/s eta 0:00:17
     -- ----------------------------------- 23.4/317.0 MB 18.2 MB/s eta 0:00:17
     -- ----------------------------------- 24.2/317.0 MB 17.7 MB/s eta 0:00:17
     -- ----------------------------------- 24.9/317.0 MB 17.2 MB/s eta 0:00:17
     --- ---------------------------------- 25.9/317.0 MB 17.7 MB/s eta 0:00:17
     --- ---------------------------------- 26.8/317.0 MB 19.3 MB/s eta 0:00:16
     --- ---------------------------------- 27.8/317.0 MB 18.2 MB/s eta 0:00:16
     --- ---------------------------------- 28.8/317.0 MB 18.7 MB/s eta 0:00:16
     --- ---------------------------------- 29.6/317.0 MB 18.7 MB/s eta 0:00:16
     --- ---------------------------------- 30.4/317.0 MB 18.7 MB/s eta 0:00:16
     --- ---------------------------------- 31.1/317.0 MB 18.7 MB/s eta 0:00:16
     --- ---------------------------------- 32.1/317.0 MB 19.3 MB/s eta 0:00:15
     --- ---------------------------------- 33.0/317.0 MB 18.7 MB/s eta 0:00:16
     ---- --------------------------------- 34.0/317.0 MB 19.3 MB/s eta 0:00:15
     ---- --------------------------------- 34.9/317.0 MB 19.3 MB/s eta 0:00:15
     ---- --------------------------------- 35.7/317.0 MB 19.2 MB/s eta 0:00:15
     ---- --------------------------------- 36.6/317.0 MB 19.8 MB/s eta 0:00:15
     ---- --------------------------------- 37.6/317.0 MB 19.9 MB/s eta 0:00:15
     ---- --------------------------------- 38.5/317.0 MB 19.3 MB/s eta 0:00:15
     ---- --------------------------------- 39.6/317.0 MB 19.3 MB/s eta 0:00:15
     ---- --------------------------------- 40.3/317.0 MB 19.3 MB/s eta 0:00:15
     ---- --------------------------------- 41.0/317.0 MB 19.3 MB/s eta 0:00:15
     ----- -------------------------------- 41.9/317.0 MB 19.3 MB/s eta 0:00:15
     ----- -------------------------------- 42.7/317.0 MB 19.2 MB/s eta 0:00:15
     ----- -------------------------------- 43.9/317.0 MB 19.2 MB/s eta 0:00:15
     ----- -------------------------------- 44.6/317.0 MB 18.7 MB/s eta 0:00:15
     ----- -------------------------------- 45.5/317.0 MB 18.7 MB/s eta 0:00:15
     ----- -------------------------------- 46.2/317.0 MB 18.7 MB/s eta 0:00:15
     ----- -------------------------------- 47.0/317.0 MB 18.7 MB/s eta 0:00:15
     ----- -------------------------------- 48.2/317.0 MB 19.3 MB/s eta 0:00:14
     ----- -------------------------------- 49.0/317.0 MB 18.7 MB/s eta 0:00:15
     ----- -------------------------------- 49.8/317.0 MB 18.7 MB/s eta 0:00:15
     ------ ------------------------------- 50.6/317.0 MB 18.7 MB/s eta 0:00:15
     ------ ------------------------------- 51.4/317.0 MB 18.7 MB/s eta 0:00:15
     ------ ------------------------------- 52.5/317.0 MB 18.7 MB/s eta 0:00:15
     ------ ------------------------------- 53.8/317.0 MB 19.3 MB/s eta 0:00:14
     ------ ------------------------------- 55.0/317.0 MB 20.5 MB/s eta 0:00:13
     ------ ------------------------------- 56.2/317.0 MB 21.8 MB/s eta 0:00:12
     ------ ------------------------------- 57.0/317.0 MB 21.1 MB/s eta 0:00:13
     ------ ------------------------------- 57.6/317.0 MB 20.5 MB/s eta 0:00:13
     ------- ------------------------------ 59.2/317.0 MB 21.8 MB/s eta 0:00:12
     ------- ------------------------------ 60.6/317.0 MB 23.4 MB/s eta 0:00:11
     ------- ------------------------------ 61.5/317.0 MB 24.2 MB/s eta 0:00:11
     ------- ------------------------------ 62.2/317.0 MB 23.4 MB/s eta 0:00:11
     ------- ------------------------------ 63.3/317.0 MB 22.6 MB/s eta 0:00:12
     ------- ------------------------------ 64.4/317.0 MB 22.6 MB/s eta 0:00:12
     ------- ------------------------------ 65.8/317.0 MB 22.6 MB/s eta 0:00:12
     ------- ------------------------------ 66.6/317.0 MB 22.6 MB/s eta 0:00:12
     -------- ----------------------------- 67.3/317.0 MB 21.8 MB/s eta 0:00:12
     -------- ----------------------------- 68.1/317.0 MB 22.6 MB/s eta 0:00:12
     -------- ----------------------------- 69.4/317.0 MB 21.9 MB/s eta 0:00:12
     -------- ----------------------------- 70.7/317.0 MB 21.8 MB/s eta 0:00:12
     -------- ----------------------------- 71.4/317.0 MB 21.1 MB/s eta 0:00:12
     -------- ----------------------------- 72.2/317.0 MB 21.1 MB/s eta 0:00:12
     -------- ----------------------------- 72.9/317.0 MB 20.5 MB/s eta 0:00:12
     -------- ----------------------------- 74.2/317.0 MB 21.1 MB/s eta 0:00:12
     --------- ---------------------------- 75.6/317.0 MB 21.1 MB/s eta 0:00:12
     --------- ---------------------------- 76.3/317.0 MB 20.5 MB/s eta 0:00:12
     --------- ---------------------------- 77.0/317.0 MB 19.9 MB/s eta 0:00:13
     --------- ---------------------------- 77.8/317.0 MB 20.5 MB/s eta 0:00:12
     --------- ---------------------------- 78.9/317.0 MB 21.1 MB/s eta 0:00:12
     --------- ---------------------------- 80.2/317.0 MB 20.5 MB/s eta 0:00:12
     --------- ---------------------------- 81.4/317.0 MB 21.1 MB/s eta 0:00:12
     --------- ---------------------------- 82.1/317.0 MB 21.1 MB/s eta 0:00:12
     --------- ---------------------------- 82.6/317.0 MB 20.5 MB/s eta 0:00:12
     ---------- --------------------------- 84.0/317.0 MB 21.1 MB/s eta 0:00:12
     ---------- --------------------------- 85.3/317.0 MB 21.1 MB/s eta 0:00:11
     ---------- --------------------------- 86.3/317.0 MB 21.1 MB/s eta 0:00:11
     ---------- --------------------------- 87.2/317.0 MB 21.8 MB/s eta 0:00:11
     ---------- --------------------------- 87.8/317.0 MB 21.1 MB/s eta 0:00:11
     ---------- --------------------------- 89.1/317.0 MB 21.8 MB/s eta 0:00:11
     ---------- --------------------------- 90.2/317.0 MB 21.1 MB/s eta 0:00:11
     ---------- --------------------------- 91.4/317.0 MB 21.1 MB/s eta 0:00:11
     ----------- -------------------------- 92.1/317.0 MB 21.9 MB/s eta 0:00:11
     ----------- -------------------------- 92.6/317.0 MB 20.5 MB/s eta 0:00:11
     ----------- -------------------------- 93.9/317.0 MB 21.1 MB/s eta 0:00:11
     ----------- -------------------------- 95.1/317.0 MB 21.1 MB/s eta 0:00:11
     ----------- -------------------------- 96.3/317.0 MB 21.1 MB/s eta 0:00:11
     ----------- -------------------------- 97.1/317.0 MB 20.5 MB/s eta 0:00:11
     ----------- -------------------------- 97.6/317.0 MB 21.1 MB/s eta 0:00:11
     ----------- -------------------------- 98.7/317.0 MB 21.8 MB/s eta 0:00:11
     ----------- ------------------------- 100.0/317.0 MB 21.1 MB/s eta 0:00:11
     ----------- ------------------------- 101.1/317.0 MB 21.8 MB/s eta 0:00:10
     ----------- ------------------------- 101.9/317.0 MB 21.1 MB/s eta 0:00:11
     ----------- ------------------------- 102.6/317.0 MB 20.5 MB/s eta 0:00:11
     ------------ ------------------------ 103.7/317.0 MB 21.1 MB/s eta 0:00:11
     ------------ ------------------------ 105.1/317.0 MB 21.8 MB/s eta 0:00:10
     ------------ ------------------------ 106.1/317.0 MB 21.8 MB/s eta 0:00:10
     ------------ ------------------------ 107.0/317.0 MB 21.8 MB/s eta 0:00:10
     ------------ ------------------------ 107.4/317.0 MB 19.9 MB/s eta 0:00:11
     ------------ ------------------------ 108.4/317.0 MB 21.1 MB/s eta 0:00:10
     ------------ ------------------------ 109.4/317.0 MB 21.1 MB/s eta 0:00:10
     ------------ ------------------------ 110.6/317.0 MB 19.8 MB/s eta 0:00:11
     ------------- ----------------------- 111.6/317.0 MB 19.8 MB/s eta 0:00:11
     ------------- ----------------------- 112.3/317.0 MB 19.8 MB/s eta 0:00:11
     ------------- ----------------------- 112.9/317.0 MB 19.8 MB/s eta 0:00:11
     ------------- ----------------------- 113.9/317.0 MB 19.8 MB/s eta 0:00:11
     ------------- ----------------------- 115.2/317.0 MB 19.8 MB/s eta 0:00:11
     ------------- ----------------------- 116.4/317.0 MB 20.5 MB/s eta 0:00:10
     ------------- ----------------------- 117.7/317.0 MB 22.5 MB/s eta 0:00:09
     ------------- ----------------------- 119.0/317.0 MB 23.4 MB/s eta 0:00:09
     -------------- ---------------------- 120.7/317.0 MB 24.2 MB/s eta 0:00:09
     -------------- ---------------------- 122.2/317.0 MB 27.3 MB/s eta 0:00:08
     -------------- ---------------------- 123.9/317.0 MB 31.2 MB/s eta 0:00:07
     -------------- ---------------------- 125.4/317.0 MB 31.2 MB/s eta 0:00:07
     -------------- ---------------------- 126.9/317.0 MB 32.7 MB/s eta 0:00:06
     --------------- --------------------- 128.6/317.0 MB 34.4 MB/s eta 0:00:06
     --------------- --------------------- 130.1/317.0 MB 34.4 MB/s eta 0:00:06
     --------------- --------------------- 131.6/317.0 MB 34.6 MB/s eta 0:00:06
     --------------- --------------------- 133.4/317.0 MB 34.4 MB/s eta 0:00:06
     --------------- --------------------- 135.1/317.0 MB 34.4 MB/s eta 0:00:06
     --------------- --------------------- 136.6/317.0 MB 34.4 MB/s eta 0:00:06
     ---------------- -------------------- 138.1/317.0 MB 34.4 MB/s eta 0:00:06
     ---------------- -------------------- 139.7/317.0 MB 34.4 MB/s eta 0:00:06
     ---------------- -------------------- 141.2/317.0 MB 34.4 MB/s eta 0:00:06
     ---------------- -------------------- 142.8/317.0 MB 34.4 MB/s eta 0:00:06
     ---------------- -------------------- 144.3/317.0 MB 34.6 MB/s eta 0:00:05
     ----------------- ------------------- 145.7/317.0 MB 32.8 MB/s eta 0:00:06
     ----------------- ------------------- 147.3/317.0 MB 32.8 MB/s eta 0:00:06
     ----------------- ------------------- 148.9/317.0 MB 32.8 MB/s eta 0:00:06
     ----------------- ------------------- 150.4/317.0 MB 32.7 MB/s eta 0:00:06
     ----------------- ------------------- 152.0/317.0 MB 32.7 MB/s eta 0:00:06
     ----------------- ------------------- 153.5/317.0 MB 32.7 MB/s eta 0:00:06
     ------------------ ------------------ 155.2/317.0 MB 32.7 MB/s eta 0:00:05
     ------------------ ------------------ 156.8/317.0 MB 34.6 MB/s eta 0:00:05
     ------------------ ------------------ 158.5/317.0 MB 34.4 MB/s eta 0:00:05
     ------------------ ------------------ 160.2/317.0 MB 34.4 MB/s eta 0:00:05
     ------------------ ------------------ 161.9/317.0 MB 34.4 MB/s eta 0:00:05
     ------------------- ----------------- 163.6/317.0 MB 36.4 MB/s eta 0:00:05
     ------------------- ----------------- 165.3/317.0 MB 36.4 MB/s eta 0:00:05
     ------------------- ----------------- 167.0/317.0 MB 36.3 MB/s eta 0:00:05
     ------------------- ----------------- 168.4/317.0 MB 34.4 MB/s eta 0:00:05
     ------------------- ----------------- 170.1/317.0 MB 34.6 MB/s eta 0:00:05
     -------------------- ---------------- 171.5/317.0 MB 34.4 MB/s eta 0:00:05
     -------------------- ---------------- 173.2/317.0 MB 34.4 MB/s eta 0:00:05
     -------------------- ---------------- 174.8/317.0 MB 34.4 MB/s eta 0:00:05
     -------------------- ---------------- 176.4/317.0 MB 32.7 MB/s eta 0:00:05
     -------------------- ---------------- 177.9/317.0 MB 32.7 MB/s eta 0:00:05
     -------------------- ---------------- 179.6/317.0 MB 34.4 MB/s eta 0:00:04
     --------------------- --------------- 181.3/317.0 MB 34.4 MB/s eta 0:00:04
     --------------------- --------------- 182.9/317.0 MB 34.6 MB/s eta 0:00:04
     --------------------- --------------- 184.6/317.0 MB 34.4 MB/s eta 0:00:04
     --------------------- --------------- 186.3/317.0 MB 34.4 MB/s eta 0:00:04
     --------------------- --------------- 188.0/317.0 MB 34.4 MB/s eta 0:00:04
     ---------------------- -------------- 189.6/317.0 MB 34.4 MB/s eta 0:00:04
     ---------------------- -------------- 191.2/317.0 MB 34.4 MB/s eta 0:00:04
     ---------------------- -------------- 192.9/317.0 MB 34.4 MB/s eta 0:00:04
     ---------------------- -------------- 194.6/317.0 MB 34.4 MB/s eta 0:00:04
     ---------------------- -------------- 196.0/317.0 MB 34.6 MB/s eta 0:00:04
     ----------------------- ------------- 197.8/317.0 MB 34.4 MB/s eta 0:00:04
     ----------------------- ------------- 199.5/317.0 MB 34.4 MB/s eta 0:00:04
     ----------------------- ------------- 201.2/317.0 MB 34.4 MB/s eta 0:00:04
     ----------------------- ------------- 202.7/317.0 MB 34.4 MB/s eta 0:00:04
     ----------------------- ------------- 204.3/317.0 MB 34.4 MB/s eta 0:00:04
     ------------------------ ------------ 206.0/317.0 MB 34.4 MB/s eta 0:00:04
     ------------------------ ------------ 207.5/317.0 MB 34.4 MB/s eta 0:00:04
     ------------------------ ------------ 209.3/317.0 MB 34.6 MB/s eta 0:00:04
     ------------------------ ------------ 210.9/317.0 MB 34.4 MB/s eta 0:00:04
     ------------------------ ------------ 212.4/317.0 MB 34.4 MB/s eta 0:00:04
     ------------------------ ------------ 214.1/317.0 MB 36.4 MB/s eta 0:00:03
     ------------------------- ----------- 215.9/317.0 MB 36.4 MB/s eta 0:00:03
     ------------------------- ----------- 217.4/317.0 MB 36.4 MB/s eta 0:00:03
     ------------------------- ----------- 219.1/317.0 MB 36.4 MB/s eta 0:00:03
     ------------------------- ----------- 220.5/317.0 MB 36.4 MB/s eta 0:00:03
     ------------------------- ----------- 222.0/317.0 MB 34.4 MB/s eta 0:00:03
     -------------------------- ---------- 223.7/317.0 MB 34.4 MB/s eta 0:00:03
     -------------------------- ---------- 225.3/317.0 MB 34.4 MB/s eta 0:00:03
     -------------------------- ---------- 226.8/317.0 MB 34.6 MB/s eta 0:00:03
     -------------------------- ---------- 228.3/317.0 MB 34.4 MB/s eta 0:00:03
     -------------------------- ---------- 230.0/317.0 MB 34.4 MB/s eta 0:00:03
     --------------------------- --------- 231.5/317.0 MB 34.4 MB/s eta 0:00:03
     --------------------------- --------- 233.4/317.0 MB 34.4 MB/s eta 0:00:03
     --------------------------- --------- 235.2/317.0 MB 36.4 MB/s eta 0:00:03
     --------------------------- --------- 236.6/317.0 MB 36.3 MB/s eta 0:00:03
     --------------------------- --------- 238.4/317.0 MB 36.3 MB/s eta 0:00:03
     ---------------------------- -------- 240.2/317.0 MB 36.4 MB/s eta 0:00:03
     ---------------------------- -------- 241.8/317.0 MB 36.4 MB/s eta 0:00:03
     ---------------------------- -------- 243.5/317.0 MB 36.4 MB/s eta 0:00:03
     ---------------------------- -------- 245.3/317.0 MB 36.4 MB/s eta 0:00:02
     ---------------------------- -------- 246.9/317.0 MB 36.4 MB/s eta 0:00:02
     ----------------------------- ------- 248.5/317.0 MB 36.4 MB/s eta 0:00:02
     ----------------------------- ------- 250.1/317.0 MB 36.3 MB/s eta 0:00:02
     ----------------------------- ------- 251.7/317.0 MB 34.4 MB/s eta 0:00:02
     ----------------------------- ------- 253.4/317.0 MB 34.6 MB/s eta 0:00:02
     ----------------------------- ------- 255.0/317.0 MB 34.4 MB/s eta 0:00:02
     ----------------------------- ------- 256.7/317.0 MB 36.4 MB/s eta 0:00:02
     ------------------------------ ------ 258.4/317.0 MB 34.4 MB/s eta 0:00:02
     ------------------------------ ------ 260.1/317.0 MB 36.4 MB/s eta 0:00:02
     ------------------------------ ------ 261.6/317.0 MB 36.4 MB/s eta 0:00:02
     ------------------------------ ------ 263.3/317.0 MB 36.3 MB/s eta 0:00:02
     ------------------------------ ------ 264.9/317.0 MB 36.3 MB/s eta 0:00:02
     ------------------------------- ----- 266.7/317.0 MB 36.4 MB/s eta 0:00:02
     ------------------------------- ----- 268.2/317.0 MB 34.4 MB/s eta 0:00:02
     ------------------------------- ----- 269.9/317.0 MB 34.4 MB/s eta 0:00:02
     ------------------------------- ----- 271.6/317.0 MB 34.4 MB/s eta 0:00:02
     ------------------------------- ----- 273.2/317.0 MB 36.4 MB/s eta 0:00:02
     -------------------------------- ---- 274.9/317.0 MB 36.4 MB/s eta 0:00:02
     -------------------------------- ---- 276.6/317.0 MB 34.4 MB/s eta 0:00:02
     -------------------------------- ---- 278.2/317.0 MB 36.3 MB/s eta 0:00:02
     -------------------------------- ---- 279.7/317.0 MB 34.6 MB/s eta 0:00:02
     -------------------------------- ---- 281.4/317.0 MB 34.4 MB/s eta 0:00:02
     --------------------------------- --- 283.1/317.0 MB 34.4 MB/s eta 0:00:01
     --------------------------------- --- 284.9/317.0 MB 36.4 MB/s eta 0:00:01
     --------------------------------- --- 286.5/317.0 MB 34.4 MB/s eta 0:00:01
     --------------------------------- --- 288.1/317.0 MB 34.4 MB/s eta 0:00:01
     --------------------------------- --- 289.7/317.0 MB 34.4 MB/s eta 0:00:01
     ---------------------------------- -- 291.5/317.0 MB 36.3 MB/s eta 0:00:01
     ---------------------------------- -- 293.2/317.0 MB 36.4 MB/s eta 0:00:01
     ---------------------------------- -- 294.9/317.0 MB 36.4 MB/s eta 0:00:01
     ---------------------------------- -- 296.6/317.0 MB 36.4 MB/s eta 0:00:01
     ---------------------------------- -- 298.3/317.0 MB 36.4 MB/s eta 0:00:01
     ----------------------------------- - 300.0/317.0 MB 36.4 MB/s eta 0:00:01
     ----------------------------------- - 301.7/317.0 MB 36.4 MB/s eta 0:00:01
     ----------------------------------- - 303.3/317.0 MB 34.4 MB/s eta 0:00:01
     ----------------------------------- - 305.1/317.0 MB 36.3 MB/s eta 0:00:01
     ----------------------------------- - 306.8/317.0 MB 36.4 MB/s eta 0:00:01
     ------------------------------------  308.4/317.0 MB 36.4 MB/s eta 0:00:01
     ------------------------------------  310.1/317.0 MB 36.4 MB/s eta 0:00:01
     ------------------------------------  311.7/317.0 MB 36.4 MB/s eta 0:00:01
     ------------------------------------  313.4/317.0 MB 36.4 MB/s eta 0:00:01
     ------------------------------------  315.0/317.0 MB 36.4 MB/s eta 0:00:01
     ------------------------------------  316.6/317.0 MB 34.4 MB/s eta 0:00:01

[notice] A new release of pip is available: 24.1.1 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

## Importamos pyspark

In [1]:
import pyspark

In [2]:
from pyspark.sql import SparkSession

In [3]:
import pandas as pd
df = pd.read_csv("./data/test1.csv")

Vamos a crear una sesiÃ³n 
Esto nos da acceso  a la API DataFrame y DataSet, que son los elementos sobre los que trabajaremos de una forma "parecida" a como hemos trabajado los Dataframes de Pandas

In [4]:
df

        Name  age  Experience  Salary
0      Krish   31          10   30000
1  Sudhanshu   30           8   25000
2      Sunny   29           4   20000
3       Paul   24           3   20000
4     Harsha   21           1   15000
5    Shubham   23           2   18000

In [5]:
spark = SparkSession.builder.appName("Practise").getOrCreate()

In [6]:
spark

Ahora vamos a leer el fichero a travÃ©s de la interfaz de sparkm

In [7]:
df_pyspark = spark.read.csv("./data/test1.csv", header= True)

In [8]:
df_pyspark.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

No lee los nombres de las columnas directamente como hace un read_csv porque no le hemos indicado nada al respecto. Ha considerado todas las filas como filas de datos y por eso la primera fila contine el nombre de las columnas

In [9]:
df_pyspark = spark.read.csv("./data/test1.csv", header= True)
df_pyspark_2 = spark.read.option("header","true").csv("./data/test1.csv")

In [10]:
df_pyspark

DataFrame[Name: string, age: string, Experience: string, Salary: string]

In [11]:
df_pyspark.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [12]:
df_pyspark_2.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [13]:
type(df_pyspark_2)

pyspark.sql.dataframe.DataFrame

In [14]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: string (nullable = true)

In [15]:
df.dtypes

Name          object
age            int64
Experience     int64
Salary         int64
dtype: object

Pyspark DataFrames  

* Leer un dataset  
* Comprobar el Schema  
* Seleccionar columnas e indexarlas  
* Opcion de describe similar a Pandas  
* Manipular columnas: AÃ±adir, Eliminar, Renombrar Columnas

In [18]:
df_pyspark_3 = spark.read.csv("./data/test1.csv", header = True, inferSchema= True)

In [19]:
df_pyspark_3.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [20]:
df_pyspark_3.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [21]:
df_pyspark_4 = spark.read.option("header","true").option("inferSchema","true").csv("./data/test1.csv")

In [22]:
df_pyspark_4.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [23]:
df_pyspark_3.dtypes

[('Name', 'string'), ('age', 'int'), ('Experience', 'int'), ('Salary', 'int')]

In [24]:
df_pyspark_3.describe().show()

+-------+------+------------------+-----------------+------------------+
|summary|  Name|               age|       Experience|            Salary|
+-------+------+------------------+-----------------+------------------+
|  count|     6|                 6|                6|                 6|
|   mean|  NULL|26.333333333333332|4.666666666666667|21333.333333333332|
| stddev|  NULL| 4.179314138308661|3.559026084010437| 5354.126134736337|
|    min|Harsha|                21|                1|             15000|
|    max| Sunny|                31|               10|             30000|
+-------+------+------------------+-----------------+------------------+

In [27]:
df.describe(include='all')

         Name        age  Experience        Salary
count       6   6.000000    6.000000      6.000000
unique      6        NaN         NaN           NaN
top     Krish        NaN         NaN           NaN
freq        1        NaN         NaN           NaN
mean      NaN  26.333333    4.666667  21333.333333
std       NaN   4.179314    3.559026   5354.126135
min       NaN  21.000000    1.000000  15000.000000
25%       NaN  23.250000    2.250000  18500.000000
50%       NaN  26.500000    3.500000  20000.000000
75%       NaN  29.750000    7.000000  23750.000000
max       NaN  31.000000   10.000000  30000.000000

In [28]:
df_pyspark_3.head()

Row(Name='Krish', age=31, Experience=10, Salary=30000)

In [29]:
df_pyspark_3.head(4)

[Row(Name='Krish', age=31, Experience=10, Salary=30000),
 Row(Name='Sudhanshu', age=30, Experience=8, Salary=25000),
 Row(Name='Sunny', age=29, Experience=4, Salary=20000),
 Row(Name='Paul', age=24, Experience=3, Salary=20000)]

SELECCIONAR COLUMNAS (select)

SELECCIONAR COLUMNAS POR NOMBRE

In [30]:
df["Name"]

0        Krish
1    Sudhanshu
2        Sunny
3         Paul
4       Harsha
5      Shubham
Name: Name, dtype: object

In [31]:
df_pyspark_3.select("Name")

DataFrame[Name: string]

En realidad todavÃ­a no ha hecho la operaciÃ³n, estÃ¡ esperando a que "sea necesario"

In [32]:
df_pyspark_3.select("Name").show()

+---------+
|     Name|
+---------+
|    Krish|
|Sudhanshu|
|    Sunny|
|     Paul|
|   Harsha|
|  Shubham|
+---------+

In [33]:
df[["Name","Salary"]]

        Name  Salary
0      Krish   30000
1  Sudhanshu   25000
2      Sunny   20000
3       Paul   20000
4     Harsha   15000
5    Shubham   18000

In [34]:
df_pyspark_3.select(["Name","Salary"]).show()

+---------+------+
|     Name|Salary|
+---------+------+
|    Krish| 30000|
|Sudhanshu| 25000|
|    Sunny| 20000|
|     Paul| 20000|
|   Harsha| 15000|
|  Shubham| 18000|
+---------+------+

INDEXADO POR COLUMNA

In [35]:
df.columns[:2]

Index(['Name', 'age'], dtype='object')

In [36]:
df_pyspark_3.columns[:2]

['Name', 'age']

In [37]:
df.iloc[:,:2]

        Name  age
0      Krish   31
1  Sudhanshu   30
2      Sunny   29
3       Paul   24
4     Harsha   21
5    Shubham   23

In [38]:
df_pyspark_3.select(df_pyspark_3.columns[:2]).show()

+---------+---+
|     Name|age|
+---------+---+
|    Krish| 31|
|Sudhanshu| 30|
|    Sunny| 29|
|     Paul| 24|
|   Harsha| 21|
|  Shubham| 23|
+---------+---+

In [39]:
df.iloc[2:4,:2]

    Name  age
2  Sunny   29
3   Paul   24

In [40]:
df_pyspark_3.select(df_pyspark_3.columns[:2]).show(3)

+---------+---+
|     Name|age|
+---------+---+
|    Krish| 31|
|Sudhanshu| 30|
|    Sunny| 29|
+---------+---+
only showing top 3 rows

CREANDO UNA NUEVA COLUMNA

In [41]:
df["new_column"] = df["Experience"] + 2
df

        Name  age  Experience  Salary  new_column
0      Krish   31          10   30000          12
1  Sudhanshu   30           8   25000          10
2      Sunny   29           4   20000           6
3       Paul   24           3   20000           5
4     Harsha   21           1   15000           3
5    Shubham   23           2   18000           4

In [42]:
df_pyspark_4 = df_pyspark_4.withColumn("new_column", df_pyspark_4["Experience"] + 2)

In [43]:
df_pyspark_4.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- new_column: integer (nullable = true)

In [44]:
df_pyspark_4.show()

+---------+---+----------+------+----------+
|     Name|age|Experience|Salary|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

ELIMINANDO COLUMNAS

In [45]:
df.drop("new_column", axis = 1)

        Name  age  Experience  Salary
0      Krish   31          10   30000
1  Sudhanshu   30           8   25000
2      Sunny   29           4   20000
3       Paul   24           3   20000
4     Harsha   21           1   15000
5    Shubham   23           2   18000

In [46]:
df_pyspark_4.drop("Experience")

DataFrame[Name: string, age: int, Salary: int, new_column: int]

In [47]:
df_pyspark_4.show()

+---------+---+----------+------+----------+
|     Name|age|Experience|Salary|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

RENOMBRANDO COLUMNAS

In [48]:
df.rename(columns={"Name": "Nombre"}, inplace = True)

In [49]:
df

      Nombre  age  Experience  Salary  new_column
0      Krish   31          10   30000          12
1  Sudhanshu   30           8   25000          10
2      Sunny   29           4   20000           6
3       Paul   24           3   20000           5
4     Harsha   21           1   15000           3
5    Shubham   23           2   18000           4

In [50]:
df_pyspark_4.withColumnRenamed("Name","Nombre").show()

+---------+---+----------+------+----------+
|   Nombre|age|Experience|Salary|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

In [51]:
df_renombrado = df_pyspark_4.withColumnRenamed("Name","Nombre")

In [52]:
df_renombrado_2 = df_renombrado.withColumnRenamed("Salary","Nomina")

In [53]:
df_renombrado_2.show()

+---------+---+----------+------+----------+
|   Nombre|age|Experience|Nomina|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

MISSING VALUES

In [54]:
df_pyspark_5 = spark.read.csv("./data/test2.csv", header = True, inferSchema= True)

In [55]:
df_pyspark_5.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

Eliminando las filas que no nos interesan

In [56]:
df_sin_missing = df_pyspark_5.na.drop()

In [57]:
df_sin_missing.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [58]:
df_sin_col_missing = df_pyspark_5.select(["age","Salary"])

In [59]:
df_sin_col_missing.show()

+----+------+
| age|Salary|
+----+------+
|  31| 30000|
|  30| 25000|
|  29| 20000|
|  24| 20000|
|  21| 15000|
|  23| 18000|
|NULL| 40000|
|  34| 38000|
|  36|  NULL|
+----+------+

La funciÃ³n drop tiene varios parÃ¡metros, entre ellos "how", con valores "any" y "all".  
* how = "any" elimina la fila si uno de los valores es nulo (comportamiento por defecto)
* how = "all" elimina la fila si todos los valores son nulos  
Otro parÃ¡metro es "tresh". Nos dice el nÃºmero minimo de valores no nulos que teine que tener una fila antes de eliminarla. Por ejemplo tresh = 2, mantiene las columnas con al menos 2 valores NO NULOS

In [60]:
df_pyspark_5.na.drop(how = "any").show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [61]:
df_pyspark_5.na.drop(how = "all").show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [62]:
df_pyspark_5.na.drop(how = "any", thresh= 2).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [63]:
df_2 = pd.read_csv("./data/test2.csv")

In [64]:
df_2

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh   NaN         NaN  40000.0
7        NaN  34.0        10.0  38000.0
8        NaN  36.0         NaN      NaN

In [65]:
df_2.dropna(how = "any")

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0

In [66]:
df_2.dropna(how = "all")

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh   NaN         NaN  40000.0
7        NaN  34.0        10.0  38000.0
8        NaN  36.0         NaN      NaN

Eliminando valores por columna

In [67]:
df_pyspark_5.na.drop(subset=("Experience")).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [68]:
df_2.dropna(subset= "Experience")

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
7        NaN  34.0        10.0  38000.0

IMPUTACION DE MISSING VALUES

In [69]:
df_pyspark_5.na.fill(20).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|   Mahesh| 20|        20| 40000|
|     NULL| 34|        10| 38000|
|     NULL| 36|        20|    20|
+---------+---+----------+------+

In [70]:
df_pyspark_5.na.fill("Pepe").show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     Pepe|  34|        10| 38000|
|     Pepe|  36|      NULL|  NULL|
+---------+----+----------+------+

In [71]:
df_2.fillna(20)

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh  20.0        20.0  40000.0
7         20  34.0        10.0  38000.0
8         20  36.0        20.0     20.0

In [72]:
df_2.Experience.fillna(20)

0    10.0
1     8.0
2     4.0
3     3.0
4     1.0
5     2.0
6    20.0
7    10.0
8    20.0
Name: Experience, dtype: float64

In [73]:
df_pyspark_5.na.fill({"Name": "Ana", "Experience": 3}).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|         3| 40000|
|      Ana|  34|        10| 38000|
|      Ana|  36|         3|  NULL|
+---------+----+----------+------+

In [74]:
from pyspark.ml.feature import Imputer

In [75]:
imputer_mean = Imputer(inputCols = ["age","Experience","Salary"], outputCols= ["imputed_age", "imputed_Experience","imputed_Salary"]).setStrategy("mean")

In [76]:
imputer_mean.fit(df_pyspark_5).transform(df_pyspark_5).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|Experience|Salary|imputed_age|imputed_Experience|imputed_Salary|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   Harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   Mahesh|NULL|      NULL| 40000|         28|                 5|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                 5|         25750|
+---------+----+----------+------+-----------+------------------+--------------+

FILTRADOS Y CONDICIONES

In [77]:
df_pyspark_5.filter("Salary <= 20000").show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [80]:
df_2[df_2['Salary'] <= 20000]

      Name   age  Experience   Salary
2    Sunny  29.0         4.0  20000.0
3     Paul  24.0         3.0  20000.0
4   Harsha  21.0         1.0  15000.0
5  Shubham  23.0         2.0  18000.0

In [81]:
condicion = df_2["Experience"] < 3
condicion_spark = df_pyspark_5["Experience"] < 3

In [82]:
df_2[condicion]

      Name   age  Experience   Salary
4   Harsha  21.0         1.0  15000.0
5  Shubham  23.0         2.0  18000.0

In [83]:
df_pyspark_5.filter(condicion_spark).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [84]:
condicion_spark_2 = (condicion_spark) & (df_pyspark_5["Salary"] > 10000)

In [85]:
df_pyspark_5.filter(condicion_spark_2).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [86]:
condicion_2 = (condicion) & (df_2["Salary"] > 10000)
df_2[condicion_2]

      Name   age  Experience   Salary
4   Harsha  21.0         1.0  15000.0
5  Shubham  23.0         2.0  18000.0

In [87]:
no_Harsha = ~(df_pyspark_5["Name"] == "Harsha")

In [88]:
df_pyspark_5.filter(no_Harsha).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
+---------+----+----------+------+

GROUPBY

In [89]:
df_pyspark_6 = spark.read.csv("./data/test3.csv", header = True, inferSchema= True)

In [90]:
df_pyspark_6.show()

+---------+------------+------+
|     Name| Departments|Salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [91]:
df_pyspark_6.groupby("Name").show()

AttributeError: 'GroupedData' object has no attribute 'show'

In [92]:
df_grouped = df_pyspark_6.groupBy("Name")

In [93]:
df_grouped.sum().show()

+---------+-----------+
|     Name|sum(Salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [95]:
df_grouped.sum().show()

+---------+-----------+
|     Name|sum(Salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [97]:
df_2.groupby("Name").sum()

            age  Experience   Salary
Name
Harsha     21.0         1.0  15000.0
Krish      31.0        10.0  30000.0
Mahesh      0.0         0.0  40000.0
Paul       24.0         3.0  20000.0
Shubham    23.0         2.0  18000.0
Sudhanshu  30.0         8.0  25000.0
Sunny      29.0         4.0  20000.0

In [98]:
df_3 = pd.read_csv("./data/test3.csv")

In [99]:
df_3

        Name   Departments  Salary
0      Krish  Data Science   10000
1      Krish           IOT    5000
2     Mahesh      Big Data    4000
3      Krish      Big Data    4000
4     Mahesh  Data Science    3000
5  Sudhanshu  Data Science   20000
6  Sudhanshu           IOT   10000
7  Sudhanshu      Big Data    5000
8      Sunny  Data Science   10000
9      Sunny      Big Data    2000

In [100]:
pd_grouped = df_3.groupby("Name")

In [101]:
pd_grouped.sum(numeric_only= True)

           Salary
Name
Krish       19000
Mahesh       7000
Sudhanshu   35000
Sunny       12000

In [102]:
df_department = df_pyspark_6.groupBy("Departments")

In [103]:
df_department.count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+

In [104]:
df_department.sum().show()

+------------+-----------+
| Departments|sum(Salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [105]:
df_department.mean().show()

+------------+-----------+
| Departments|avg(Salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [106]:
pd_departments = df_3.groupby("Departments")

In [107]:
pd_departments.count()

              Name  Salary
Departments
Big Data         4       4
Data Science     4       4
IOT              2       2

In [108]:
pd_departments.sum()

                                   Name  Salary
Departments
Big Data      MaheshKrishSudhanshuSunny   15000
Data Science  KrishMaheshSudhanshuSunny   43000
IOT                      KrishSudhanshu   15000

In [109]:
pd_departments.sum(numeric_only= True)

              Salary
Departments
Big Data       15000
Data Science   43000
IOT            15000

AGGREGATE

In [110]:
df_pyspark_6.agg({"Salary": "sum"}).show()

+-----------+
|sum(Salary)|
+-----------+
|      73000|
+-----------+

In [111]:
df_pyspark_6.groupBy("Departments").agg({"Salary": "sum"}).show()

+------------+-----------+
| Departments|sum(Salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [112]:
pd_departments.agg(["sum","mean","count"])

TypeError: agg function failed [how->mean,dtype->object]

In [ ]:
df_pyspark_6.groupBy("Departments").agg({"Salary": "sum", "Salary": "mean", "Name": "count"}).show()

+------------+-----------+-----------+
| Departments|avg(Salary)|count(Name)|
+------------+-----------+-----------+
|         IOT|     7500.0|          2|
|    Big Data|     3750.0|          4|
|Data Science|    10750.0|          4|
+------------+-----------+-----------+

APLICAR FUNCIONES

In [116]:
from pyspark.sql.functions import lower,col,ascii,mean

In [117]:
df_pyspark_6.show()

+---------+------------+------+
|     Name| Departments|Salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [118]:
df_pyspark_6.select(lower(col("Name"))).show()

+-----------+
|lower(Name)|
+-----------+
|      krish|
|      krish|
|     mahesh|
|      krish|
|     mahesh|
|  sudhanshu|
|  sudhanshu|
|  sudhanshu|
|      sunny|
|      sunny|
+-----------+

In [121]:
df_3['Name'] = df_3['Name'].apply(lambda x: x.lower())
df_3['Name']

0        krish
1        krish
2       mahesh
3        krish
4       mahesh
5    sudhanshu
6    sudhanshu
7    sudhanshu
8        sunny
9        sunny
Name: Name, dtype: object

In [119]:
df_test = df_pyspark_6.withColumn("New_Column", ascii(col("Name")))

In [113]:
df_test.show()

+---------+------------+------+----------+
|     Name| Departments|Salary|New_Column|
+---------+------------+------+----------+
|    Krish|Data Science| 10000|        75|
|    Krish|         IOT|  5000|        75|
|   Mahesh|    Big Data|  4000|        77|
|    Krish|    Big Data|  4000|        75|
|   Mahesh|Data Science|  3000|        77|
|Sudhanshu|Data Science| 20000|        83|
|Sudhanshu|         IOT| 10000|        83|
|Sudhanshu|    Big Data|  5000|        83|
|    Sunny|Data Science| 10000|        83|
|    Sunny|    Big Data|  2000|        83|
+---------+------------+------+----------+

In [115]:
valores = df_pyspark_6.select(mean(col("Salary")))

In [116]:
type(valores)

pyspark.sql.dataframe.DataFrame

In [117]:
valores.printSchema()

root
 |-- avg(Salary): double (nullable = true)

In [118]:
valores.show()

+-----------+
|avg(Salary)|
+-----------+
|     7300.0|
+-----------+